#include "i2c.H"

#define  DELAY_L	28
#define  DELAY_S	12

/********************************************************************************  
函数功能: 延时	
*******************************************************************************/ 
void delay(unsigned int i)
{ 
    while(i--);
}

/********************************************************************************
函数功能: 启动i2c  
********************************************************************************/
void i2c_start(void)
{
    SDAD1;			//SDA口设为输出
    SCL = 1;
    delay(DELAY_S);	//_3NOP();
    SDA = 1;
    delay(DELAY_L);	//_7NOP();		
    SDA = 0;
    delay(DELAY_L);	//起始信号建立保持时间大于4.7us
    SCL = 0;		
    delay(DELAY_S);	//保持SCL低电平迫使进入等待状态
}

/********************************************************************************
函数功能: 停止i2c  
********************************************************************************/
void i2c_stop(void)
{
    SDAD1;				//SDA口设为输出
    SDA = 0;
    delay(DELAY_L);	
    SCL = 1;
    delay(DELAY_L);		
    SDA = 1;
    delay(DELAY_L);		//停止信号建立时间大于4us
}

/********************************************************************************
函数功能: ck为1时发送应答信号,ck为0时不发送  
	ck:应答
********************************************************************************/
void i2c_ACK(unsigned char ck)
{
    SDAD1;				//SDA口设为输出
    if(ck) SDA = 0;else SDA = 1;
    delay(DELAY_L);		//SCK低电平保持时间大于4.7us
    SCL = 1;
    delay(DELAY_L);		//SCK高电平保持时间大于4us
    SCL = 0;
    delay(DELAY_S);
}

/********************************************************************************
函数功能: 检查应答信号  
返回数据: 收到应答信号返回1,没收到返回0
********************************************************************************/
unsigned char  i2c_waitACK(void)
{
    unsigned char x;
    SDAD0;					//SDA口设为输入
	SDA = 1;
    delay(DELAY_S);			//补偿读写时时钟的低电平延时
    SCL = 1;
    delay(DELAY_S);
    if(SDA)x = 0;else x = 1; //SDA 1未收到ACK /0接收到ACK	
    delay(DELAY_S);
    SCL = 0;
    delay(DELAY_L);
    return x;	
}

/********************************************************************************
函数功能: 发送1字节数据  
	bt:
********************************************************************************/
void i2c_sendbyte(unsigned char bt)
{
    unsigned char i;
    SDAD1;						//SDA口设为输出
    for(i=0;i<8;i++)
    {
        if(bt&0x80)SDA = 1;else SDA = 0;
        bt <<= 1;				//向左移出1位
        delay(DELAY_S);			//取数据最高位
        SCL = 1;
        delay(DELAY_L);
        SCL = 0;
        delay(DELAY_S);
    }
}

/********************************************************************************
函数功能: 接收1字节数据 
返回数据: dee
********************************************************************************/
unsigned char i2c_recbyte(void)
{
    unsigned char dee;
    unsigned char j;
    SDAD0;						//SDA口设为输 入
    for(j=0;j<8;j++)
    {		
        SCL = 1;
        delay(DELAY_S);
        dee = dee <<1;
        if(SDA) dee|=0x01;  	//和最低进行或运算
        delay(DELAY_S);
        SCL = 0;
        delay(DELAY_L);
    }
    return dee;
}
/********************************************************************************/
/********************************************************************************/
